Revit 2024 API
GroupSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual GroupSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As GroupSetIterator
Visual C++
public:
virtual GroupSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
GroupSet Class
Autodesk.Revit.DB Namespace